example.yml
execution:
- concurrency: 100
  ramp-up: 15s
  hold-for: 30s
  scenario: siteblaze
  criteria: 
    - fail>0%
    - avg-rt>1s
  
scenarios:
  siteblaze:
    requests:
    - http://blazedemo.com
    # criteria: 
    #   - fail>0%
    #   - avg-rt>1s

  apiblaze:
    requests:
    - url: https://api.demoblaze.com/entries
      label: Entries API
      method: GET
      follow-redirects: true
      assert:
        - contains: Items
          regex: false

reporting:
- module: passfail
  criteria:
    Tempo Medio Resposta Muito Alto: avg-rt>300ms
    Requests Com Falha Acima Do Esperado: fail>1%
    
- module: junit-xml
  filename: reports/report.xml
  data-source: pass-fail

- module: final-stats
  summary: true
  percentiles: true
  test-duration: true
  failed-labels: false
  dump-xml: reports/xml-jenkins.xml
  dump-csv: reports/csv-jenkins.csv