example.yml
execution:
- concurrency: 100
  ramp-up: 15s
  hold-for: 30s
  scenario: siteblaze
  criteria: 
    - fail>0%
    - avg-rt>1s
  
scenarios:
  siteblaze:
    requests:
    - http://blazedemo.com
    # criteria: 
    #   - fail>0%
    #   - avg-rt>1s

  apiblaze:
    requests:
    - url: https://api.demoblaze.com/entries
      label: Entries API
      method: GET
      follow-redirects: true
      assert:
        - contains: Items
          regex: false

reporting:
- module: passfail
  criteria:
    - Tempo de resposta medio muito alto: avg-rt>300ms for 2s, stop as failed
    - Existem Requests com status code de falha: fail>0% 
- module: junit-xml
  filename: reports/report.xml
  data-source: pass-fail